app/controllers/api/v1/documents_controller.rb

      def update
        document = Document.find(document_id_params['id'])

        title = document_params['title']
        content = document_params['content']
        document.update(title: title, content: content)
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "documents" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "documents"."id" = $4  [["title", nil], ["content", "Be like Spock. 42"], ["updated_at", 2016-07-17 14:53:02 UTC], ["id", 1]]

      def show
        render json: Document.find(document_id_params[:id])
---
SELECT  "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]